In [ ]:
# imports
import re
import time
import sqlite3
import pycountry
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import cm
from sklearn.feature_extraction.text import CountVectorizer
import warnings
warnings.filterwarnings("ignore")
sns.set_theme(style = "whitegrid")

In [ ]:
!imdb-sqlite

In [ ]:
conn = sqlite3.connect('imdb.db')

In [ ]:
tabelas = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type = 'table'", conn)

In [ ]:
type(tabelas)

In [ ]:
tabelas.head()

In [ ]:
tabelas = tabelas['Table_Name'].values.tolist()

In [ ]:
for tabela in tabelas:
    consulta = "PRAGMA TABLE_INFO({})".format(tabela)
    resultado = pd.read_sql_query(consulta, conn)
    print("Esquema da tabela: ", tabela)
    display(resultado)
    print("-"*100)
    print("\n")

In [4]:
!imdb-sqlite

2022-05-10 22:57:22,917 GET https://datasets.imdbws.com/name.basics.tsv.gz -> downloads/name.basics.tsv.gz
2022-05-10 22:57:39,858 GET https://datasets.imdbws.com/title.basics.tsv.gz -> downloads/title.basics.tsv.gz
2022-05-10 22:57:50,438 GET https://datasets.imdbws.com/title.akas.tsv.gz -> downloads/title.akas.tsv.gz
2022-05-10 22:58:11,224 GET https://datasets.imdbws.com/title.principals.tsv.gz -> downloads/title.principals.tsv.gz
2022-05-10 22:58:37,143 GET https://datasets.imdbws.com/title.episode.tsv.gz -> downloads/title.episode.tsv.gz
2022-05-10 22:58:38,716 GET https://datasets.imdbws.com/title.ratings.tsv.gz -> downloads/title.ratings.tsv.gz
2022-05-10 22:58:38,928 Populating database: imdb.db
2022-05-10 22:58:38,928 Applying schema
2022-05-10 22:58:38,930 Importing file: downloads/name.basics.tsv.gz
2022-05-10 22:58:38,930 Reading number of rows ...
2022-05-10 22:58:42,920 Inserting rows into table: people
100%|████████████████████████| 11617319/11617319 [01:26<00:00, 134073.52 rows/s]
2022-05-10 23:00:09,577 Importing file: downloads/title.basics.tsv.gz
2022-05-10 23:00:09,577 Reading number of rows ...
2022-05-10 23:00:12,731 Inserting rows into table: titles
100%|██████████████████████████| 8911007/8911007 [01:24<00:00, 106029.64 rows/s]
2022-05-10 23:01:36,776 Importing file: downloads/title.akas.tsv.gz
2022-05-10 23:01:36,776 Reading number of rows ...
2022-05-10 23:01:43,746 Inserting rows into table: akas
100%|████████████████████████| 31979346/31979346 [03:56<00:00, 135031.27 rows/s]
2022-05-10 23:05:40,578 Importing file: downloads/title.principals.tsv.gz
2022-05-10 23:05:40,578 Reading number of rows ...
2022-05-10 23:05:50,495 Inserting rows into table: crew
100%|████████████████████████| 50240379/50240379 [05:03<00:00, 165746.57 rows/s]
2022-05-10 23:10:53,613 Importing file: downloads/title.episode.tsv.gz
2022-05-10 23:10:53,614 Reading number of rows ...
2022-05-10 23:10:54,679 Inserting rows into table: episodes
100%|██████████████████████████| 6689310/6689310 [00:32<00:00, 206348.96 rows/s]
2022-05-10 23:11:27,099 Importing file: downloads/title.ratings.tsv.gz
2022-05-10 23:11:27,099 Reading number of rows ...
2022-05-10 23:11:27,225 Inserting rows into table: ratings
100%|██████████████████████████| 1242892/1242892 [00:06<00:00, 189528.29 rows/s]
2022-05-10 23:11:33,785 Creating table indices ...
2022-05-10 23:14:15,093 Import successful

In [7]:
conn = sqlite3.connect('imdb.db')

In [17]:
tabelas = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type = 'table'", conn)

In [18]:
type(tabelas)

pandas.core.frame.DataFrame

In [19]:
tabelas.head()

  Table_Name
0     people
1     titles
2       akas
3       crew
4   episodes

In [20]:
tabelas = tabelas['Table_Name'].values.tolist()

In [21]:
for tabela in tabelas:
    consulta = "PRAGMA TABLE_INFO({})".format(tabela)
    resultado = pd.read_sql_query(consulta, conn)
    print("Esquema da tabela: ", tabela)
    display(resultado)
    print("-"*100)
    print("\n")

Esquema da tabela:  people

   cid       name     type  notnull dflt_value  pk
0    0  person_id  VARCHAR        0       None   1
1    1       name  VARCHAR        0       None   0
2    2       born  INTEGER        0       None   0
3    3       died  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Esquema da tabela:  titles

   cid             name     type  notnull dflt_value  pk
0    0         title_id  VARCHAR        0       None   1
1    1             type  VARCHAR        0       None   0
2    2    primary_title  VARCHAR        0       None   0
3    3   original_title  VARCHAR        0       None   0
4    4         is_adult  INTEGER        0       None   0
5    5        premiered  INTEGER        0       None   0
6    6            ended  INTEGER        0       None   0
7    7  runtime_minutes  INTEGER        0       None   0
8    8           genres  VARCHAR        0       None   0

----------------------------------------------------------------------------------------------------


Esquema da tabela:  akas

   cid               name     type  notnull dflt_value  pk
0    0           title_id  VARCHAR        0       None   0
1    1              title  VARCHAR        0       None   0
2    2             region  VARCHAR        0       None   0
3    3           language  VARCHAR        0       None   0
4    4              types  VARCHAR        0       None   0
5    5         attributes  VARCHAR        0       None   0
6    6  is_original_title  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Esquema da tabela:  crew

   cid        name     type  notnull dflt_value  pk
0    0    title_id  VARCHAR        0       None   0
1    1   person_id  VARCHAR        0       None   0
2    2    category  VARCHAR        0       None   0
3    3         job  VARCHAR        0       None   0
4    4  characters  VARCHAR        0       None   0

----------------------------------------------------------------------------------------------------


Esquema da tabela:  episodes

   cid              name     type  notnull dflt_value  pk
0    0  episode_title_id  INTEGER        0       None   0
1    1     show_title_id  INTEGER        0       None   0
2    2     season_number  INTEGER        0       None   0
3    3    eposide_number  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Esquema da tabela:  ratings

   cid      name     type  notnull dflt_value  pk
0    0  title_id  VARCHAR        0       None   1
1    1    rating  INTEGER        0       None   0
2    2     votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------